Revit 2027 API
ExternalService.GetPublicAccessKey Method
 Access key to use to execute a service.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GetPublicAccessKey()
Public Function GetPublicAccessKey As Guid
public:
Guid GetPublicAccessKey()
member GetPublicAccessKey : unit -> Guid
Return Value
Guid
 GUID representing the access key.
Exceptions
Exception | Condition
InvalidOperationException |  The service is not public, thus the access key cannot be obtained.
Remarks
The service must be declared as public in order for callers be able to invoke this method. Services that are not public can be executed only by their owners (the ones who registered it).
Most services are not public and may only be executed by their respective owners. To see whether a service was declared as public, call the GetOptions method and check the IsPublic property.
See Also
Reference
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace